Autodesk.Revit.DB.ControlShape
An enumerated type listing four shapes of control that Autodesk Revit supports.

Autodesk.Revit.DB.ControlShape.DoubleHorizontalArrow
Double horizontal arrow.

Autodesk.Revit.DB.ControlShape.DoubleVerticalArrow
Double vertical arrow.

Autodesk.Revit.DB.ControlShape.HorizontalArrow
Horizontal arrow.

Autodesk.Revit.DB.ControlShape.VerticalArrow
Vertical arrow.